Revit 2026 API

# CompoundStructureLayerCount Property

---

Returns the number of layers contained in this CompoundStructure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int LayerCount { get; }
```
```vb
Public ReadOnly Property LayerCount As Integer
	Get
```
```cpp
public:
property int LayerCount {
	int get ();
}
```
```fsharp
member LayerCount : int with get
```

#### Property Value

Int32

Establishes the valid range of indices passed to various access functions: [0 ... this value - 1]

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace